Repository: Basel-Abd-Alsous/Jawad-Driver-Application
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Bank Name
ar: اسم البنك

# enter_bank_name
source: Enter Your Bank Name
ar: أدخل اسم البنك

source: Number
ar: الرقم

# enter_number
source: Enter Your Number
ar: أدخل الرقم

source: IBAN
ar: رقم الآيبان

# enter_iban
source: Enter Your IBAN
ar: أدخل رقم الآيبان

source: Swift Code
ar: رمز السويفت

# enter_swift_code
source: Enter Your Swift Code
ar: أدخل رمز السويفت

source: Code
ar: الرمز

# enter_code
source: Enter Your Code
ar: أدخل الرمز

source: Or
ar: او

source: Visa
ar: بطاقة الائتمان

# selectBirthDate
source: Select your birth date
ar: اختر تاريخ ميلادك

# enterIdNumber
source: Enter Your ID Number
ar: رقم الهوية

source: Payment Method
ar: طريقة الدفع

# birth
source: Birth date
ar: تاريخ ميلادك

source: WhatsApp
ar: واتساب

source: Instagram
ar: انستغرام

source: Twitter
ar: تويتر

source: Back
ar: رجوع

source: Feedback
ar: ملاحظات

source: Commission
ar: العمولة

source: Driver Profit
ar: ربح السائق

source: Feedback Type
ar: نوع الملاحظة

# pleaseSelectFeedbackType
source: Please select a feedback type
ar: الرجاء اختيار نوع الملاحظة

source: Remaining amount
ar: المبلغ المتبقي

# create_new_account
source: Create a new account
ar: إنشاء حساب جديد

source: Created Account
ar: تم إنشاء الحساب

# account_created_success
source: Your account has been successfully created and is now pending approval.
ar: تم إنشاء الحساب بنجاح وهو قيد الموافقة الآن.

source: Home
ar: الرئيسية

source: Skip
ar: تخطي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Email
ar: البريد الإلكتروني

# update_profile_error
source: Something went wrong in update profile
ar: حدث خطأ أثناء تحديث الملف الشخصي

# update_profile_success
source: Update profile successfully
ar: تم تحديث الملف الشخصي بنجاح

# trip
source: My Trip
ar: رحلاتي

# contact_via_whatsapp
source: Contact us via WhatsApp
ar: تواصل معنا عبر واتساب

# follow_on_instagram
source: Follow us on Instagram
ar: تابعنا على انستغرام

# follow_on_twitter
source: Follow us on Twitter
ar: تابعنا على تويتر

source: Submit
ar: ارسال

source: Add Rating
ar: اضافة تقييم

source: Withdraw Cash
ar: طلب سحب نقدي

source: Loading ...
ar: جارٍ التحميل ...

# cashRequsetSuccess
source: Cash request submitted successfully
ar: تم تقديم طلب السحب بنجاح

source: Delete Your Account
ar: حذف حسابك

source: Warning
ar: تحذير

source: Plate Number
ar: رقم اللوحة

source: Enter Plate Number
ar: أدخل رقم اللوحة

source: Terms & Conditions
ar: الشروط و الاحكام

source: Plate Code
ar: حروف اللوحة

source: Enter Plate Code
ar: أدخل حروف اللوحة

source: Privacy Policy
ar: سياسة الخصوصية

source: Type
ar: النوع

# select_type
source: Select a type
ar: اختر النوع

# please_select_type
source: Please select a type
ar: الرجاء اختيار النوع

source: Model
ar: الموديل

# select_model
source: Select a model
ar: اختر موديل

# please_select_model
source: Please select a model
ar: الرجاء اختيار موديل

source: Color
ar: اللون

# select_color
source: Select a color
ar: اختر لوناً

# please_select_color
source: Please select a color
ar: الرجاء اختيار لون

source: Are you sure you want to delete your account?
ar: هل أنت متأكد أنك تريد حذف حسابك؟

# continues
source: Continue
ar: متابعة

source: Successfully
ar: تم بنجاح

# proceed_next_step
source: Proceed to the next step to upload your documents.
ar: تابع إلى الخطوة التالية لتحميل مستنداتك.

# back_button
source: Back
ar: رجوع

source: New Password
ar: كلمة المرور الجديدة

source: Enter New Password
ar: أدخل كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Enter Confirm Password
ar: أدخل تأكيد كلمة المرور

source: Update
ar: تحديث

source: Password Changed
ar: تم تغيير كلمة المرور

# password_updated_success
source: Your password has been successfully updated.
ar: تم تحديث كلمة المرور بنجاح.

# selec
source: Select
ar: اختر

source: Mobile
ar: الجوال

source: Send
ar: إرسال

# check_phone
source: Check your phone for the verification code we just sent.
ar: تحقق من هاتفك للحصول على رمز التحقق الذي أرسلناه للتو.

source: Verify
ar: تحقق

source: Password
ar: كلمة المرور

# password_hint
source: Enter Your Password
ar: أدخل كلمة المرور الخاصة بك

# dont_have_account
source: Don't have an account?
ar: ليس لديك حساب؟

source: Full Name
ar: الاسم الكامل

# full_name_hint
source: Enter Your Fullname
ar: أدخل اسمك الكامل

# confirm_password_hint
source: Enter Confirm Password
ar: أدخل تأكيد كلمة المرور

# create_account_terms
source: By clicking on Create an account, you agree to the terms of use and privacy policy
ar: بالنقر على إنشاء حساب، فإنك توافق على شروط الاستخدام وسياسة الخصوصية

# already_have_account
source: Already have an account?
ar: هل لديك حساب؟

source: Login
ar: تسجيل الدخول

source: Registration Completed
ar: اكتملت عملية التسجيل

source: We Send To
ar: لقد أرسلنا إلى

source: You Don't Receive OTP?
ar: لم تستلم رمز التحقق؟

source: Resend OTP
ar: إعادة إرسال الرمز

source: Verification Completed
ar: تم التحقق

# account_verified
source: Your account has been successfully verified.
ar: تم التحقق من حسابك بنجاح.

# enter_banking_info_title
source: Enter your banking information
ar: أدخل معلوماتك المصرفية

# enter_banking_info_description
source: As a driver, enter your banking information.
ar: كسائق، أدخل معلوماتك المصرفية.

# enter_car_info_title
source: Enter your car information
ar: أدخل معلومات سيارتك

# enter_car_info_description
source: As a driver, enter your car details below.
ar: كسائق، أدخل تفاصيل سيارتك أدناه.

# add_new_password_title
source: Add New Password
ar: أضف كلمة مرور جديدة

# add_new_password_description
source: Create a new password to secure your account. Make sure it’s something you’ll remember!
ar: قم بإنشاء كلمة مرور جديدة لتأمين حسابك. تأكد من أنها شيء يمكنك تذكره!

# upload_documents_title
source: Upload All Documents
ar: رفع جميع المستندات

# upload_documents_description
source: Upload all the required documents.
ar: قم برفع جميع المستندات المطلوبة.

# forget_password_title
source: Forgot your password
ar: هل نسيت كلمة المرور؟

# forget_password_description
source: Can’t remember your password? Jawad’s got your back—let’s get you going again.
ar: لا تستطيع تذكر كلمة المرور؟ جواد هنا لمساعدتك — دعنا نعيدك إلى المسار.

# verify_title
source: Verify your account
ar: تحقق من حسابك

# verify_description
source: We’ve sent a code to your mobile number. Please enter it below to verify your identity.
ar: أرسلنا رمزًا إلى رقم هاتفك المحمول. الرجاء إدخاله أدناه للتحقق من هويتك.

# auth_register_title
source: Register and go with us!
ar: سجل وانطلق معنا!

# auth_register_subtitle
source: Whether you are a passenger or a driver, 'Jawad' guarantees you a unique and easy-to-use experience
ar: سواء كنت راكبًا أو سائقًا، يضمن لك 'جواد' تجربة فريدة وسهلة الاستخدام

# auth_login_title
source: Log in and enjoy your journey!
ar: سجّل دخولك واستمتع برحلتك!

# auth_login_subtitle
source: Whether you're a rider or a driver, Jawad ensures you a unique and user-friendly experience
ar: سواء كنت راكبًا أو سائقًا، يضمن لك جواد تجربة فريدة وسهلة الاستخدام

source: Forget Password
ar: نسيت كلمة المرور

# previous_trips
source: My Previous Trips
ar: رحلاتي السابقة

source: Earnings
ar: الارباح

source: Notifications
ar: الإشعارات

# support
source: Complaints
ar: الشكاوي

source: Language
ar: اللغة

source: Create Complaint
ar: إنشاء شكوى

source: Contact Us
ar: اتصل بنا

# contact_description
source: Get in touch with us via any of the following methods:
ar: تواصل معنا عبر أي من الطرق التالية:

source: Call Us
ar: اتصل بنا

source: Email Us
ar: راسلنا عبر البريد الإلكتروني

source: WhatsApp Us
ar: راسلنا عبر واتساب

# complaint_screen_message
source: Have a problem or feedback? Share your complaint here, and we’ll get back to you as soon as possible.
ar: هل تواجه مشكلة أو لديك ملاحظات؟ شارك شكواك هنا، وسنقوم بالرد عليك في أقرب وقت ممكن.

source: Phone Number
ar: رقم الهاتف

source: Message
ar: الرسالة

source: Attachments (Optional)
ar: المرفقات (اختياري)

source: Add Attachments
ar: إضافة مرفقات

source: Submit Complaint
ar: إرسال الشكوى

source: files
ar: ملفات

source: Logout
ar: تسجيل الخروج

# primetag_copyright
source: by Primetag Company
ar: برمجة شركة Primetag

source: New request received
ar: توصلت بطلب

# no_requests
source: No requests available
ar: لا يوجد طلبات

source: Available
ar: متاح

source: Not Available
ar: غير متاح

# activate_status_message
source: Activate your status to available to start receiving requests
ar: قم بتفعيل الحالة الخاصة بك الى متاح للبدأ بستفبال الطلبات

# activate_status_button
source: Activate Status
ar: تفعيل الحالة

source: Accept Request
ar: قبول الطلب

source: Reject Request
ar: رفض الطلب

source: Go to Client
ar: الذهاب للعميل

# cancel_request
source: Cancel
ar: الغاء الطلب

source: Start Trip
ar: بدء الرحلة

source: Finish Trip
ar: انهاء الرحلة

# arrived_destination_button
source: Arrived at Client Destination
ar: وصلت وجهتك للعميل

source: Select Language
ar: اختر اللغة

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Next
ar: التالي

# onboarding_title_1
source: Welcome to Jawad
ar: مرحبًا بك في جواد

# onboarding_desc_1
source: Easily book your trip anytime, anywhere! Choose your destination, enjoy your journey, and leave the rest to us.
ar: احجز رحلتك بسهولة في أي وقت ومن أي مكان! اختر وجهتك، واستمتع برحلتك، واترك الباقي علينا.

# onboarding_title_2
source: Safe and Reliable Trips
ar: رحلات آمنة وموثوقة

# onboarding_desc_2
source: With Jawad's professional drivers, we provide you with a comfortable and secure experience, live trip tracking, and multiple payment options to suit you.
ar: مع سائقي جواد المحترفين، نقدم لك تجربة مريحة وآمنة، مع تتبع مباشر للرحلة وخيارات دفع متعددة تناسبك.

# onboarding_title_3
source: Earn or Ride with Ease!
ar: اكسب أو اركب بسهولة!

# onboarding_desc_3
source: Whether you're a rider or a driver, Jawad ensures you a unique and user-friendly experience. Start now and enjoy smart mobility!
ar: سواء كنت راكبًا أو سائقًا، يضمن لك جواد تجربة فريدة وسهلة الاستخدام. ابدأ الآن واستمتع بالتنقل الذكي!

source: My Documents
ar: ملفاتي

# select_document
source: Select
ar: اختر

source: Call
ar: الإتصال

source: Cancel Trip
ar: إلغاء الرحلة

# tripEnded
source: Your trip has ended
ar: إنتهت رحلتك

source: Download Invoice
ar: تحميل الفاتورة

source: Report Behavior
ar: إبلاغ عن سلوك

source: Trip Number
ar: رقم الرحلة

source: Departure
ar: الإنطلاق

source: Destination
ar: الوجهة

source: Distance
ar: المسافة

source: Time
ar: الساعة

# paymentInApp
source: From the app
ar: من التطبيق

source: Amount
ar: المبلغ الإجمالي

source: My Wallet
ar: محفظتي

source: Charge Wallet
ar: اشحن محفظتك

# enterAmountHint
source: Enter Amount ...
ar: أدخل المبلغ ...

# requiredField
source: This field is required
ar: هذه الخانة مطلوبة

source: Charge
ar: اشحن

# emptyUserNameHint
source: Please enter your username
ar: يرجى إدخال اسم المستخدم

# ibanEmpty
source: Please enter the IBAN
ar: يرجى إدخال رقم الآيبان

# ibanStartWithSA
source: IBAN must start with 'SA'
ar: يجب أن يبدأ رقم الآيبان بـ "SA"

# ibanLength
source: Saudi IBAN must be 24 characters long
ar: رقم الآيبان السعودي يجب أن يتكون من 24 خانة

# ibanInvalidFormat
source: Invalid IBAN format
ar: تنسيق رقم الآيبان غير صحيح

# plateRequired
source: This field is required
ar: هذه الخانة مطلوبة

# plateLength
source: Plate number must be 4 characters (letters or digits)
ar: يجب أن تتكون اللوحة من 4 خانات (أحرف أو أرقام)

# plateInvalid
source: Plate must contain only letters or numbers
ar: اللوحة يجب أن تحتوي على أحرف أو أرقام فقط

# emptyMobileHint
source: Please enter your mobile number
ar: يرجى إدخال رقم الجوال

# notValidMobileHint
source: Invalid mobile number
ar: رقم الجوال غير صحيح

# emptyEmailHint
source: Please enter your email
ar: يرجى إدخال البريد الإلكتروني

# notValidEmailHint
source: Invalid email address
ar: البريد الإلكتروني غير صالح

# emptyPasswordHint
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# passwordValidateLengthHint
source: Password must be at least 5 characters
ar: يجب أن تكون كلمة المرور على الأقل 5 خانات

# confirmPasswordEmpty
source: Please enter confirm password
ar: يرجى إدخال تأكيد كلمة المرور

# confirmPasswordNotMatch
source: Passwords do not match
ar: كلمة المرور غير متطابقة

# emptyFieldHint
source: This field is required
ar: هذه الخانة مطلوبة

# minValidateHint
source: Input is too short
ar: القيمة المدخلة قصيرة جداً

# maxValidateHint
source: Input is too long
ar: القيمة المدخلة طويلة جداً

source: Transactions History
ar: سجل الدفعات

source: Empty Transactions
ar: لا توجد دفعات

source: Empty Notifications
ar: لا توجد إشعارات

# noNotificationsYet
source: You Don't Have Any Notifications Yet!
ar: لا توجد إشعارات حتى الآن!

# noTransactionsYet
source: You Don't Have Any Transactions Yet!
ar: لا توجد أي دفعات حتى الآن!

source: Visit Details
ar: تفاصيل الرحلة

source: Canceled Trips
ar: الرحلات الملغاة
